

// 1) კომენტარების სახით ახსენით ფუნქციების შექმნის რამდენი ხერხი გვაქვს, 
// ასევე ჩამოთვალეთ თითოეული და დაწერეთ რით განსხვავდება ერთმანეთისგან


// ფუნქციის შექმნის საკმაოდ ბევრი ხერხი გვაქვს დავთლი მაიცა :დ


// function func_name() { return "gamarjoba" } ეს პირველი გზა


// const func_name = function() {
//  return "გამარჯობა"
// } ეს არის უსახელო ფუნქცია მეორე გზა


// const func_name = () => {
// return "გამარჯობა"
// } ეს არის მესამე გზა arrow function


// მოკლედ ნასწავლი გვაქვს 3 გზა შექმნის განსხვავება syntax-ი
