

# 1. შექმენით პროგრამა სადაც მომხმარებელი შემოიყვანს ასაკს და თქვენ უნდა გაარკვიოთ, უნდა იაროს მან ბაღში,
#  სკოლაში თუ სამსახურში: თუ ასაკი მეტი იქნება 2-ზე == ბაღი | 
# თუ ასაკი მეტია ან უდრის 6-ს == სკოლაში | დანარჩენ შემთხვევაში სამსახური.

# user_age = int(input("Enter age: "))

# if user_age < 6:
#     print("უნდა იარო ბაღში")
# elif user_age < 18:
#     print("უნდა იარო სკოლაში")
# else:
#     print("სამსახური დაიწყე მეგობარო :დ")









# 2. შექმენით პროგრამა რომელშიც: მომხმარებელს შემოყავს ინფორმაცია თუ რომელ პროგრამირების  აკადემიაში დადის, 
# თუ მან შეიყვანა "Goa", გამოიტანეთ "U r a real chad!", ხოლო დანარჩენ შემთხვევაში "Join Goa, become a chad".

# pa = str(input("ჩაწერე აკადემია რომელშიც დადიხარ: "))


# if pa == "Goa":
#     print("U r a real chad!")
# else:
#     print("Join Goa, become a chad")








# 3. მომხმარებელს შემოყავს პროექტში მიღებული ქულის შესახებ, თუ ის 90-ზე მეტია შეფასებაა A,
# თუ 75-ზე მეტია შეფასებაა B, თუ 60-ზე მეტია შეფასებაა C, თუ 50-ზე მეტია შეფასებაა D, თუ 40-ზე E და თუ 30-ზე F, Good Luck💚

# user_score = int(input("Enter score: "))

# if user_score >= 90:
#     print("შეფასება: A")
# elif user_score >= 75:
#     print("შეფასება: B")
# elif user_score >= 60:
#     print("შეფასება: C")
# elif user_score >= 50:
#     print("შეფასება: D")
# elif user_score >= 40:
#     print("შეფასება: E")
# elif user_score >= 30:
#     print("შეფასება: F")





# 4.  გადახედეთ დამატებით მასალას: https://www.w3schools.com/python/gloss_python_else.asp