# 2) ახსენით რა განსხვავებაა While და for loop-ებს შორის

# while ლუპით გვიწევს ყველაფრის გაკეთება ხელით და for ლუპს ეს 
# რასაც ჩვენ 
# while ლუპით ვაკეთებთ გაკეთებული აქვს მაგ:

# i = 0
# while i<5:
#     print(i)
#     i += 1 # ეს იგივეა რაც i = i + 1

# ესაა while ლუპის სინტაქსი რაც ჩვენ ხელით გავაკეთეთ და for ლუპს ეს უკვე გამზადებული აქვს

# for i in range(5):
#     print(i)

# ესაა for ლუპი ჩვენ while ლუპში შევქმენით ცვლადი i რომელიც default-ად = 0-ს 
# და for ლუპი ამას თავისით აკეთებს ასევე <5 ჩვენ for ლუპში ვიყენებ range(5) და
# i += 1 ჩვენ ცვალდის 1-ით გასაზრდელად ვიყენებდით ამ კოდს მაგრამ for ლუპი ამასაც თავისით აკეთებს ესაა განსხვავება