# 1) შექმენით პროგრამა, რომელშიც მომხმარებელი შემოიტანს რიცხვს, თქვენ უნდა გამოიტანოთ ამ რიცხვის 
# ყველა გამყოფი (ის რიცხვები რომლებზეც გაყოფისას მომხმარებლის მიერ შემოტანილ რიცხვზე ნაშთი 0-ია) 

# user_number = int(input("Enter Num: "))

# for i in range(1, user_number):
#     if user_number % i == 0:
#         print(i)



# 2) ახსენით რა განსხვავებაა While და for loop-ებს შორის

# while ლუპით გვიწევს ყველაფრის გაკეთება ხელით და for ლუპს ეს 
# რასაც ჩვენ 
# while ლუპით ვაკეთებთ გაკეთებული აქვს მაგ:

# i = 0
# while i<5:
#     print(i)
#     i += 1 # ეს იგივეა რაც i = i + 1

# ესაა while ლუპის სინტაქსი რაც ჩვენ ხელით გავაკეთეთ და for ლუპს ეს უკვე გამზადებული აქვს

# for i in range(5):
#     print(i)

# ესაა for ლუპი ჩვენ while ლუპში შევქმენით ცვლადი i რომელიც default-ად = 0-ს 
# და for ლუპი ამას თავისით აკეთებს ასევე <5 ჩვენ for ლუპში ვიყენებ range(5) და
# i += 1 ჩვენ ცვალდის 1-ით გასაზრდელად ვიყენებდით ამ კოდს მაგრამ for ლუპი ამასაც თავისით აკეთებს ესაა განსხვავება





# 3) გადახედეთ დამატებით მასალას: https://www.w3schools.com/python/python_while_loops.asp


# 4) რა არის ამ გამოსახულების პასუხი:
# 1 = True და 0 = False
# (1 and 0) or (1 and 1) and (0 or 0) 

# (1 = True and 0 = False) or (1 = True and 1 = True ) and (0 = False or 0 = False) # False



# 5) უყურეთ ამ ვიდეობს და კარგად გაიაზრეთ, თუ შეძლებთ ამოიწერეთ მნიშვნელოვანი ინფორმაცია:

# https://youtu.be/rRTjPnVooxE?si=uvpNW5Qtwdm9CjAe

# https://youtu.be/KWgYha0clzw?si=osV0laGK4LR8UwzW