


# 1) მომხმარებელს შემოატანინეთ ოთხი რიცხვი და გამოიტანეთ მათი საშუალო არითმეტიკული.

# user_num1 = int(input("Enter Num1: "))
# user_num2 = int(input("Enter Num2: "))
# user_num3 = int(input("Enter Num3: "))
# user_num4 = int(input("Enter Num4: "))

# shekreba = user_num1 + user_num2 + user_num3 + user_num4

# print(shekreba / 4)













# 2) მომხმარებელს შემოატანინეთ სახელი და გვარი, შემდეგ გამოპრინტეთ ტექსტი: „მოგესალმები, [სახელი] [გვარი]!“


# firstname = str(input("Enter Your FirstName: "))
# lastname = str(input("Enter Your LastName: "))

# print("მოგესალმებით,", firstname, lastname + "!")













# 3) მომხმარებელს შემოატანინეთ ორი რიცხვი და გამოიტანეთ მათი სტრინგებად გაერთიანებული ვერსია, რომლის შუაშიც იქნება "😊" ემოჯი.


# user_num1 = input("Enter num1: ")
# user_num2 = input("Enter num2: ")

# gaertianeba = str(user_num1) + "😊" + str(user_num2)

# print(gaertianeba)
