

# 1) დაწერეთ პითონის პროგრამა, რომელიც ქმნის ჯერ სტრინგს შემდეგ ინტეჯერს 
# 2) დაწერეთ პითონის პროგრამა, რომელიც ჯერ ქმნის სტრინგ 'გამარჯობას', შემდეგ ქმნის სტრინგ 'ელემენტი' - ათჯერ ( ერთ ხაზზე ), შემდეგ ქმნის ინტეჯერ 1000- ორი ინტეჯერი რიცვის მეშვეობით, შემდეგ ქმნის სტრინგ 'hello world' - ორი სტრინგის მეშვეობით , და ბოლოს ქმნის ბულეანს, თუმცა არა პირდაპირ True ან False-ის დაწერით ( მინიშნება დაგჭირდებათ მოცემულიდან, რომელიმე ოპერაციების გამოყენება რომელიმე პროგრამის ნაწილში: +, -, *, / )
# 3) შექმენით პრეზენტაცია თქვენი სასურველი ხელსაწყოთი ( მაგ: paint, powerpoint, ფურცელი და პასტა... ) რომელიც ხსნის თუ რა არის data type, აუცილებლად გამოიყენეთ თქვენი ცოდნა და სიტყვები.
# (✨◡✨)   წარმატებები! *:･ﾟ🌟


# 1) დაწერეთ პითონის პროგრამა, რომელიც ქმნის ჯერ სტრინგს შემდეგ ინტეჯერს 

string = "Vaxo"
print(string)
integer = 15
print(integer)


# 2) დაწერეთ პითონის პროგრამა, რომელიც ჯერ ქმნის სტრინგ 'გამარჯობას', შემდეგ ქმნის სტრინგ 'ელემენტი' - ათჯერ ( ერთ ხაზზე ), შემდეგ ქმნის ინტეჯერ 1000- ორი ინტეჯერი რიცვის მეშვეობით, შემდეგ ქმნის სტრინგ 'hello world' - ორი სტრინგის მეშვეობით , და ბოლოს ქმნის ბულეანს, თუმცა არა პირდაპირ True ან False-ის დაწერით ( მინიშნება დაგჭირდებათ მოცემულიდან, რომელიმე ოპერაციების გამოყენება რომელიმე პროგრამის ნაწილში: +, -, *, / )

str_hello = "Hello"
print(str_hello)
str_element = "Element" * 10
print(str_element)
int_1000 = 500 + 500
print(int_1000)
str_twotext = "Hello" + "World"
print(str_twotext)
bool_True = 15 > 5
print(bool_True)
bool_False = 15 < 5
print(bool_False)




# 3) შექმენით პრეზენტაცია თქვენი სასურველი ხელსაწყოთი ( მაგ: paint, powerpoint, ფურცელი და პასტა... ) რომელიც ხსნის თუ რა არის data type, აუცილებლად გამოიყენეთ თქვენი ცოდნა და სიტყვები.
# (✨◡✨)   წარმატებები! *:･ﾟ🌟

