# 2. შექმენით ფუნქცია სადაც მომხმარებელი გადასცემს 
# ორ არგუმენტს, ორივე არის რიცხვი მაგრამ არ იცით თუ 
# როგორი სახითაა იგი ჩაწერილი (string თუ integer), 
# თქვენი დავალებაა შეკრიბოთ ეს ორი რიცხვი, მაგრამ 
# გაითვალისწინოთ ისიც, რომ მომხმარებელმა შეიძლება 
# შმეოიტანოს boolean ან float (String-ში ყოველთვის იქნება რიცხვები).


def x(one, two):
    return float(one) + float(two)
    

print("პასუხი:", x("5", 10))
print("პასუხი:", x("3.5", 4))
print("პასუხი:", x(True, "10"))
print("პასუხი:", x(False, 2.2))