# 4. For loop-ის დახმარებით შექმენით პროგრამა, 
# სადაც მომხმარებელი შემოიტანს რიცხვს (50-ის ჩათვლით, 
# თუ არა დაუპრინტეთ, რომ თავიდან შეიყვანოს), 
# და თქვენ გამოიტანეთ ამ რიცხვის ჯერადები 100-ის ჩათვლით.

user_num = int(input("შეიყვანე რიცხვი (50-მდე): "))

for i in range(1, 50):
    if user_num>50:
        user_num = int(input("არასწორია, შეიყვანე რიცხვი თავიდან (50-მდე): "))

    elif user_num<0:
        user_num = int(input("არასწორია, შეიყვანე რიცხვი თავიდან (50-მდე): "))

    else:
        for x in range(0, 100, user_num):
            print(f"{user_num}-ის ჯერადებია {x}")