


# 2) მომხმარებელს ჰკითხე 5 საყვარელი ხილის სახელი და შეინახე სია.

# დაამატე 2 დამატებითი ხილი.

# წაშალე სიის ბოლო ელემენტი.

# დაბეჭდე სია საწყისი სორტირებით და ალფავიტური სორტირებით.

print("------ შეიყვანე შენი 5 საყვარელი ხილი ------")

erti = input("შეიყვანე ხილი 1:")
ori = input("შეიყვანე ხილი 2:")
sami = input("შეიყვანე ხილი 3:")
otxi = input("შეიყვანე ხილი 4:")
xuti = input("შეიყვანე ხილი 5:")



my_list = [erti, ori, sami, otxi, xuti]

my_list.append("კივი")
my_list.append("ანანასი")

my_list.pop(-1)

print(sorted(my_list))


